; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_3 ?v7 ?v3)
             (pred_8 ?v5 ?v8)
             (pred_11 ?v7 ?v8)
             (pred_7 ?v1 ?v7 )
	     (pred_6 ?v7)
             (pred_9 ?v12)
             (pred_2 ?v5)
             (pred_5 ?v8)
             (pred_12 ?v7)
             (pred_10 ?v5)
             (pred_1 ?v7)
             (pred_4 ))



(:action op_4
:parameters (?v6 ?v9 ?v2 ?v11)
:precondition (and (pred_9 ?v6) (pred_9 ?v9) (pred_2 ?v2) (pred_5 ?v11)
          (pred_3 ?v6 ?v9) (pred_8 ?v2 ?v11)
                   (pred_11 ?v9 ?v11) (pred_6 ?v6) 
                   (pred_12 ?v9) (pred_10 ?v2))
:effect (and  (pred_1 ?v9) (not (pred_12 ?v9))))


(:action op_1
:parameters (?v6 ?v10)
:precondition (and (pred_9 ?v6) (pred_9 ?v10)
               (pred_6 ?v6) (pred_3 ?v6 ?v10) (pred_1 ?v10))
:effect (and (pred_6 ?v10) (not (pred_6 ?v6))))

(:action op_2
:parameters (?v6 ?v2)
:precondition (and (pred_9 ?v6) (pred_2 ?v2) 
                  (pred_6 ?v6) (pred_7 ?v2 ?v6) (pred_4 ))
:effect (and (pred_10 ?v2)
   (not (pred_7 ?v2 ?v6)) (not (pred_4 ))))


(:action op_3
:parameters (?v6 ?v4 ?v13)
:precondition (and (pred_9 ?v6) (pred_2 ?v4) (pred_2 ?v13)
                  (pred_6 ?v6) (pred_10 ?v13) (pred_7 ?v4 ?v6))
:effect (and (pred_10 ?v4) (pred_7 ?v13 ?v6)
        (not (pred_10 ?v13)) (not (pred_7 ?v4 ?v6))))

(:action op_5
:parameters (?v6 ?v2)
:precondition (and (pred_9 ?v6) (pred_2 ?v2) 
                  (pred_6 ?v6) (pred_10 ?v2))
:effect (and (pred_4 ) (pred_7 ?v2 ?v6) (not (pred_10 ?v2)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_30 obj_29 obj_08 obj_12 obj_18 obj_07 obj_03 obj_10 obj_15 obj_19 obj_17 obj_09 obj_26 obj_13 obj_01 obj_16 obj_21 obj_28 obj_27 obj_22 obj_23 obj_05 obj_31 obj_25 obj_24
    obj_02 obj_11 obj_14
    obj_06 obj_20 obj_04
    )

    (:init
       (pred_4)

       (pred_9 obj_30)
       (pred_9 obj_29)
       (pred_9 obj_08)
       (pred_9 obj_12)
       (pred_9 obj_18)
       (pred_9 obj_07)
       (pred_9 obj_03)
       (pred_9 obj_10)
       (pred_9 obj_15)
       (pred_9 obj_19)
       (pred_9 obj_17)
       (pred_9 obj_09)
       (pred_9 obj_26)
       (pred_9 obj_13)
       (pred_9 obj_01)
       (pred_9 obj_16)
       (pred_9 obj_21)
       (pred_9 obj_28)
       (pred_9 obj_27)
       (pred_9 obj_22)
       (pred_9 obj_23)
       (pred_9 obj_05)
       (pred_9 obj_31)
       (pred_9 obj_25)
       (pred_9 obj_24)
       (pred_5 obj_02)
       (pred_5 obj_11)
       (pred_5 obj_14)
       (pred_2 obj_06)
       (pred_2 obj_20)
       (pred_2 obj_04)

       (pred_3 obj_30 obj_07)
       (pred_3 obj_30 obj_29)
       (pred_3 obj_29 obj_03)
       (pred_3 obj_29 obj_08)
       (pred_3 obj_29 obj_30)
       (pred_3 obj_08 obj_10)
       (pred_3 obj_08 obj_12)
       (pred_3 obj_08 obj_29)
       (pred_3 obj_12 obj_15)
       (pred_3 obj_12 obj_18)
       (pred_3 obj_12 obj_08)
       (pred_3 obj_18 obj_19)
       (pred_3 obj_18 obj_12)
       (pred_3 obj_07 obj_17)
       (pred_3 obj_07 obj_03)
       (pred_3 obj_07 obj_30)
       (pred_3 obj_03 obj_09)
       (pred_3 obj_03 obj_10)
       (pred_3 obj_03 obj_29)
       (pred_3 obj_03 obj_07)
       (pred_3 obj_10 obj_26)
       (pred_3 obj_10 obj_15)
       (pred_3 obj_10 obj_08)
       (pred_3 obj_10 obj_03)
       (pred_3 obj_15 obj_13)
       (pred_3 obj_15 obj_19)
       (pred_3 obj_15 obj_12)
       (pred_3 obj_15 obj_10)
       (pred_3 obj_19 obj_01)
       (pred_3 obj_19 obj_18)
       (pred_3 obj_19 obj_15)
       (pred_3 obj_17 obj_16)
       (pred_3 obj_17 obj_09)
       (pred_3 obj_17 obj_07)
       (pred_3 obj_09 obj_21)
       (pred_3 obj_09 obj_26)
       (pred_3 obj_09 obj_03)
       (pred_3 obj_09 obj_17)
       (pred_3 obj_26 obj_28)
       (pred_3 obj_26 obj_13)
       (pred_3 obj_26 obj_10)
       (pred_3 obj_26 obj_09)
       (pred_3 obj_13 obj_27)
       (pred_3 obj_13 obj_01)
       (pred_3 obj_13 obj_15)
       (pred_3 obj_13 obj_26)
       (pred_3 obj_01 obj_22)
       (pred_3 obj_01 obj_19)
       (pred_3 obj_01 obj_13)
       (pred_3 obj_16 obj_23)
       (pred_3 obj_16 obj_21)
       (pred_3 obj_16 obj_17)
       (pred_3 obj_21 obj_05)
       (pred_3 obj_21 obj_28)
       (pred_3 obj_21 obj_09)
       (pred_3 obj_21 obj_16)
       (pred_3 obj_28 obj_31)
       (pred_3 obj_28 obj_27)
       (pred_3 obj_28 obj_26)
       (pred_3 obj_28 obj_21)
       (pred_3 obj_27 obj_25)
       (pred_3 obj_27 obj_22)
       (pred_3 obj_27 obj_13)
       (pred_3 obj_27 obj_28)
       (pred_3 obj_22 obj_24)
       (pred_3 obj_22 obj_01)
       (pred_3 obj_22 obj_27)
       (pred_3 obj_23 obj_05)
       (pred_3 obj_23 obj_16)
       (pred_3 obj_05 obj_31)
       (pred_3 obj_05 obj_21)
       (pred_3 obj_05 obj_23)
       (pred_3 obj_31 obj_25)
       (pred_3 obj_31 obj_28)
       (pred_3 obj_31 obj_05)
       (pred_3 obj_25 obj_24)
       (pred_3 obj_25 obj_27)
       (pred_3 obj_25 obj_31)
       (pred_3 obj_24 obj_22)
       (pred_3 obj_24 obj_25)
       (pred_12 obj_29)
       (pred_12 obj_05)
       (pred_12 obj_16)
       (pred_11  obj_29 obj_02)
       (pred_11  obj_05 obj_11)
       (pred_11  obj_16 obj_14)
       (pred_1 obj_30)
       (pred_1 obj_08)
       (pred_1 obj_12)
       (pred_1 obj_18)
       (pred_1 obj_07)
       (pred_1 obj_03)
       (pred_1 obj_10)
       (pred_1 obj_15)
       (pred_1 obj_19)
       (pred_1 obj_17)
       (pred_1 obj_09)
       (pred_1 obj_26)
       (pred_1 obj_13)
       (pred_1 obj_01)
       (pred_1 obj_21)
       (pred_1 obj_28)
       (pred_1 obj_27)
       (pred_1 obj_22)
       (pred_1 obj_23)
       (pred_1 obj_31)
       (pred_1 obj_25)
       (pred_1 obj_24)

       (pred_8  obj_06 obj_02)
       (pred_8  obj_20 obj_11)
       (pred_8  obj_04 obj_14)
       (pred_7 obj_06 obj_10)
       (pred_7 obj_20 obj_22)
       (pred_7 obj_04 obj_01)
       (pred_6 obj_26)
    )

    (:goal (and
       (pred_7 obj_20 obj_28)
    ))
(:constraints
  (always (not (pred_6 obj_27)))
)
)

; plan
1. (op_1 obj_26 obj_28)
   deleted: (pred_6 obj_26)
   added: (pred_6 obj_28)
   goals met: 0 of 1
2. (op_1 obj_28 obj_31)
   deleted: (pred_6 obj_28)
   added: (pred_6 obj_31)
   goals met: 0 of 1
3. (op_1 obj_31 obj_25)
   deleted: (pred_6 obj_31)
   added: (pred_6 obj_25)
   goals met: 0 of 1
4. (op_1 obj_25 obj_24)
   deleted: (pred_6 obj_25)
   added: (pred_6 obj_24)
   goals met: 0 of 1
5. (op_1 obj_24 obj_22)
   deleted: (pred_6 obj_24)
   added: (pred_6 obj_22)
   goals met: 0 of 1
6. (op_2 obj_22 obj_20)
   deleted: (pred_7 obj_20 obj_22) (pred_4)
   added: (pred_10 obj_20)
   goals met: 0 of 1
7. (op_1 obj_22 obj_01)
   deleted: (pred_6 obj_22)
   added: (pred_6 obj_01)
   goals met: 0 of 1
8. (op_1 obj_01 obj_13)
   deleted: (pred_6 obj_01)
   added: (pred_6 obj_13)
   goals met: 0 of 1
9. (op_1 obj_13 obj_26)
   deleted: (pred_6 obj_13)
   added: (pred_6 obj_26)
   goals met: 0 of 1
10. (op_1 obj_26 obj_28)
   deleted: (pred_6 obj_26)
   added: (pred_6 obj_28)
   goals met: 0 of 1
11. (op_5 obj_28 obj_20)
   deleted: (pred_10 obj_20)
   added: (pred_4) (pred_7 obj_20 obj_28)
   goals met: 1 of 1
